Repository: wafiqmuhaz/boilerplateapp
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, de, es, id

# counterAppBarTitle
source: Counter
ar: العداد
de: Zähler
es: Contador
id: Penghitung

source: Load failed
ar: فشل التحميل
de: Laden fehlgeschlagen
es: Error al cargar
id: Gagal memuat

source: Dog image random
ar: صورة كلب عشوائية
de: Zufälliges Hundebild
es: Imagen de perro aleatoria
id: Gambar anjing acak

source: Load image
ar: تحميل الصورة
de: Bild laden
es: Cargar imagen
id: Muat gambar

source: Go route
ar: الانتقال إلى المسار
de: Route gehen
es: Ir a la ruta
id: Jalankan rute

source: Press button
ar: اضغط الزر
de: Taste drücken
es: Presione el botón
id: Tekan tombol

source: Config
ar: التكوين
de: Konfiguration
es: Configuración
id: Konfigurasi

source: English
ar: الإنجليزية
de: Englisch
es: Inglés
id: Inggris

source: Vietnamese
ar: الفيتنامية
de: Vietnamesisch
es: Vietnamita
id: Vietnam

source: Dark mode
ar: الوضع الداكن
de: Dunkler Modus
es: Modo oscuro
id: Mode gelap

# assets
source: Assets gen
ar: توليد الموارد
de: Assets-Generierung
es: Generación de activos
id: Gen aset

source: Load and insert DB
ar: تحميل وإدخال البيانات في قاعدة البيانات
de: Laden und Einfügen der DB
es: Cargar e insertar base de datos
id: Muat dan masukkan DB

source: Image from DB
ar: الصورة من قاعدة البيانات
de: Bild aus der DB
es: Imagen de la base de datos
id: Gambar dari DB

source: Delete success
ar: تم الحذف بنجاح
de: Löschen erfolgreich
es: Borrar con éxito
id: Hapus berhasil

source: Delete failed
ar: فشل الحذف
de: Löschen fehlgeschlagen
es: Error al eliminar
id: Gagal menghapus

# didnt_supported
source: Floor didnt support
ar: قاعدة البيانات Floor غير مدعومة
de: Boden nicht unterstützt
es: El piso no fue compatible
id: Lantai tidak mendukung

# kLanguageIndonesia
source: Indonesian
ar: الإندونيسية
de: Indonesisch
es: Indonesio
id: Bahasa Indonesia

# kToggle
source: Toggle
ar: تبديل
de: Umschalten
es: Cambiar
id: Beralih

# kTheme
source: Theme
ar: الموضوع
de: Thema
es: Tema
id: Tema

# kLanguage
source: Select a language
ar: اختيار اللغة
de: Wähle eine Sprache aus
es: Selecciona un idioma
id: Pilih bahasa

# kApp_name
source: Flutter Production Boilerplate
ar: Boilerplate إنتاج Flutter
de: Flutter Produktions Boilerplate
es: Plantilla de producción de Flutter
id: Boilerplate Produksi Flutter

# kApp_name_2
source: Flutter Boilerplate
ar: Boilerplate Flutter
es: Plantilla de Flutter
id: Boilerplate Flutter

# kBottom_nav_first
source: Home
ar: الرئيسية
de: Startseite
es: Inicio
id: Beranda

# kBottom_nav_second
source: Info
ar: معلومات
id: Informasi

# kLocalization_title
source: Localization
ar: الترجمة
de: Lokalisierung
es: Localización
id: Penerjemahan

# kLocalization_content
source: Simplified translations with the L10n package.
ar: .ترجمات مبسطة باستخدام حزمة ل١٠ن
de: Vereinfachte Übersetzungen mit dem L10n Paket.
es: Traducciones simplificadas con el paquete L10n.
id: Penerjemahan yang disederhanakan dengan paket L10n.

# kLinting_content
source: Stricter linting rules with flutter lints recommended by the Dart team.
ar: قواعد Linting أكثر صرامة باستخدام Flutter Lints الموصى بها من فريق Dart.
de: Striktere Linting-Regeln mit den von Dart empfohlenen flutter lints.
es: Reglas de linting más estrictas con flutter lints recomendadas por el equipo de Dart.
id: Aturan linting yang lebih ketat dengan flutter lints yang direkomendasikan oleh tim Dart.

# kStorage_title
source: Storage
ar: التخزين
de: Speicher
es: Almacenamiento
id: Penyimpanan

# kStorage_content
source: Blazing fast key-value database written in pure Dart with Hive.
ar: قاعدة بيانات مفتوحة المصدر سريعة جدًا لقيم المفاتيح مكتوبة بلغة Dart النقية مع Hive.
de: Schnelle Key-Value-Datenbank in reinem Dart mit Hive.
es: Base de datos de clave-valor extremadamente rápida escrita en Dart puro con Hive.
id: Database kunci-nilai super cepat yang ditulis dalam bahasa Dart murni dengan Hive.

# kDark_mode_title
source: Dark Mode
ar: الوضع الداكن
de: Dunkler Modus
es: Modo oscuro
id: Mode Gelap

# kDark_mode_content
source: Smooth transition to dark mode by using the inbuilt theming engine.
ar: انتقال سلس إلى الوضع الداكن باستخدام محرك السمات المضمن.
de: Sanfter Übergang zum dunklen Modus durch Verwendung des integrierten Theming-Engine.
es: Transición suave al modo oscuro mediante el motor de temas incorporado.
id: Transisi yang halus ke mode gelap dengan menggunakan mesin pewarnaan bawaan.

# kState_title
source: State
ar: الحالة
de: Zustand
es: Estado

# kState_content
source: Powerful state management using Cubit & BLOC.
ar: إدارة حالة قوية باستخدام Cubit & BLOC.
de: Leistungsstarke Zustandsverwaltung mit Cubit & BLOC.
es: Gestión de estado potente usando Cubit & BLOC.
id: Manajemen state yang kuat menggunakan Cubit & BLOC.

# kDisplay_title
source: Display
ar: الشاشة
de: Anzeige
es: Visualización
id: Tampilan

# kDisplay_content
source: Support for high refresh rate displays with the flutter displaymode package.
ar: دعم الشاشات ذات معدل تحديث عالٍ باستخدام حزمة Flutter وضع الشاشة.
de: Unterstützung für Displays mit hoher Bildwiederholfrequenz mit dem Flutter Displaymode-Paket.
es: Soporte para pantallas con alta tasa de refresco con el paquete flutter displaymode.
id: Dukungan untuk tampilan dengan refresh rate tinggi dengan paket flutter displaymode.

# kLanguage_switch_title
source: Use german
ar: استخدام الألمانية
de: Deutsch verwenden
es: Usar alemán
id: Gunakan bahasa Jerman

# kGithub_card_title
source: GitHub repository
ar: مستودع GitHub
es: Repositorio de GitHub
id: Repositori GitHub

# kWebsite_card_title
source: Website
ar: موقع إلكتروني
es: Sitio web
id: Situs web

# kTwitter_card_title
source: Twitter
ar: تويتر

# kInstagram_card_title
source: Instagram
ar: إنستغرام

# kDonate_card_title
source: Donate
ar: تبرع
de: Spenden
es: Donar
id: Donasi

# kAuthor_divider_title
source: Author
ar: المؤلف
de: Autor
es: Autor
id: Penulis

# kPackages_divider_title
source: Packages
ar: الحزم
de: Pakete
es: Paquetes
id: Paket

# kPath_provider
source: Path provider
ar: موفر المسار
de: Pfadprovider
es: Proveedor de ruta

# kUrl_launcher
source: Url launcher
ar: مشغل الرابط
es: Lanzador de URL

# kIonicons
source: Ionicons
ar: أيونيكونز

# kExamples
source: Examples
ar: أمثلة
de: Beispiele
es: Ejemplos
id: Contoh

# kFeatures
source: Features
ar: المميزات
de: Funktionen
es: Funciones
id: Fitur

# kFoundation
source: Foundation
ar: الأساس
de: Grundlage
es: Fundación
id: Dasar

# kComingSoon
source: Coming Soon
ar: قريبًا
de: Kommt bald
es: Próximamente
id: Segera Hadir

# kLatestStableFlutterVersion
source: Latest stable Flutter version
ar: أحدث إصدار مستقر من Flutter
de: Neueste stabile Flutter-Version
es: Última versión estable de Flutter
id: Versi Flutter Stabil Terbaru

# kLatestStableFlutterVersionDesc
source: Our application offers the latest stable Flutter version, ensuring a seamless and efficient user experience.
ar: يوفر تطبيقنا أحدث إصدار مستقر من Flutter، مما يضمن تجربة مستخدم سلسة وفعالة.
de: Unsere Anwendung bietet die neueste stabile Flutter-Version und sorgt somit für eine nahtlose und effiziente Benutzererfahrung.
es: Nuestra aplicación ofrece la última versión estable de Flutter, asegurando una experiencia de usuario fluida y eficiente.
id: Aplikasi kami menawarkan versi Flutter stabil terbaru, memastikan pengalaman pengguna yang mulus dan efisien.

# kNullSafetyDesc
source: Equipped with several advanced features, such as Null Safety, providing a safer and more reliable experience for developers.
ar: مجهزة بالعديد من الميزات المتقدمة، مثل Null Safety، مما يوفر تجربة أكثر أمانًا وموثوقية للمطورين.
de: Ausgestattet mit mehreren fortschrittlichen Funktionen wie der Nullsicherheit, die für Entwickler eine sicherere und zuverlässigere Erfahrung bietet.
es: Equipado con varias características avanzadas, como Null Safety, proporcionando una experiencia más segura y confiable para los desarrolladores.
id: Dilengkapi dengan beberapa fitur canggih, seperti Null Safety, yang menyediakan pengalaman yang lebih aman dan dapat diandalkan bagi para pengembang.

# kBuildFlavorsDesc
source: Allowing developers to create and customize multiple versions of the app for different target audiences.
ar: يتيح للمطورين إنشاء وتخصيص عدة إصدارات من التطبيق لجمهور مستهدف مختلف.
de: Ermöglicht Entwicklern, mehrere Versionen der App für unterschiedliche Zielgruppen zu erstellen und anzupassen.
es: Permitiendo a los desarrolladores crear y personalizar varias versiones de la aplicación para diferentes audiencias objetivo.
id: Memungkinkan para pengembang untuk membuat dan menyesuaikan beberapa versi aplikasi untuk berbagai audiens target.

# kCustomSplashScreen
source: Custom Splash Screen
ar: شاشة ترحيب مخصصة
de: Benutzerdefinierter Splash Screen
es: Pantalla de inicio personalizada
id: Splash Screen Kustom

# kCustomAppIcons
source: Custom App Icons
ar: أيقونات التطبيق المخصصة
de: Benutzerdefinierte App-Icons
es: Iconos de aplicación personalizados
id: Icon Aplikasi Kustom

# kSecureStorage
source: Secure Storage (Keystore/ Keychain)
ar: تخزين آمن (Keystore/ Keychain)
de: Sicherer Speicher (Schlüsselspeicher/Keychain)
es: Almacenamiento seguro (Keystore/Keychain)
id: Penyimpanan Aman (Keystore/ Keychain)

# kAutomationMaintenance
source: Automation & Maintenance
ar: الأتمتة والصيانة
de: Automatisierung & Wartung
es: Automatización y mantenimiento
id: Otomatisasi & Pemeliharaan

# kGitHubActionsWorkflows
source: GitHub Actions Workflows
ar: سير العمل لـ GitHub Actions
es: Flujos de trabajo de GitHub Actions
id: Alur Kerja Tindakan GitHub

# kGitHubActionsWorkflowsDesc
source: Streamlining the development and deployment process by automating tasks such as building, testing, and deploying code changes.
ar: تبسيط عملية التطوير والنشر عن طريق أتمتة المهام مثل بناء واختبار ونشر تغييرات الشفرة.
de: Automatisierung von Aufgaben wie dem Erstellen, Testen und Bereitstellen von Code-Änderungen, um den Entwicklungs- und Bereitstellungsprozess zu optimieren.
es: Agilizando el proceso de desarrollo e implementación automatizando tareas como la construcción, prueba e implementación de cambios de código.
id: Mempermudah proses pengembangan dan penyebaran dengan mengotomatisasi tugas-tugas seperti membangun, menguji, dan menyebarluaskan perubahan kode.

# kComprehensiveUnitTests
source: Comprehensive Unit Tests
ar: اختبارات الوحدة الشاملة
de: Umfassende Unit-Tests
es: Pruebas unitarias exhaustivas
id: Penguji Unit Komprehensif

# kComprehensiveUnitTestsDesc
source: Equipped with Comprehensive Unit Tests, ensuring the stability and reliability of the app.
ar: مجهزة بـ اختبارات الوحدة الشاملة، مما يضمن الاستقرار والموثوقية للتطبيق.
de: Ausgestattet mit umfassenden Unit-Tests, die die Stabilität und Zuverlässigkeit der App gewährleisten.
es: Equipado con pruebas unitarias exhaustivas, asegurando la estabilidad y confiabilidad de la aplicación.
id: Dilengkapi dengan Penguji Unit Komprehensif, memastikan stabilitas dan keandalan aplikasi.

# kComprehensiveWidgetTests
source: Comprehensive Widget Tests
ar: اختبارات الويدجت الشاملة
de: Umfassende Widget-Tests
es: Pruebas exhaustivas de widgets
id: Penguji Widget Komprehensif

# kComprehensiveWidgetTestsDesc
source: Equipped with Comprehensive Widget Tests, ensuring the stability and functionality of the app's user interface.
ar: مجهزة بـ اختبارات الويدجت الشاملة، مما يضمن استقرار ووظائف واجهة المستخدم للتطبيق.
de: Ausgestattet mit umfassenden Widget-Tests, die die Stabilität und Funktionalität der Benutzeroberfläche der App gewährleisten.
es: Equipado con pruebas exhaustivas de widgets, asegurando la estabilidad y funcionalidad de la interfaz de usuario de la aplicación.
id: Dilengkapi dengan Penguji Widget Komprehensif, memastikan stabilitas dan fungsionalitas antarmuka pengguna aplikasi.

# kForceUpgrade
source: Force Upgrade
ar: إجبار الترقية
de: Erzwungene Aktualisierung
es: Actualización forzada
id: Pembaruan Paksa

# kDownforMaintenance
source: Down for Maintenance (Kill Switch)
ar: تعطيل للصيانة (Kill Switch)
de: Wartungsarbeiten (Kill Switch)
es: Cerrado por mantenimiento (Kill Switch)
id: Sedang Dalam Pemeliharaan (Kill Switch)

# kInAppReviewSupport
source: In-App Review Support
ar: دعم مراجعة التطبيق في التطبيق
de: Unterstützung für Bewertungen in der App
es: Soporte de revisión en la aplicación
id: Dukungan Ulasan Di Dalam Aplikasi

# kCICD
source: CI/CD with ?
ar: CI/CD مع؟
de: CI/CD mit ?
es: CI/CD con ?
id: CI/CD dengan ?

# kUserManagement
source: User Management
ar: إدارة المستخدمين
de: Benutzerverwaltung
es: Gestión de usuarios
id: Manajemen Pengguna

# kGoogleSignIn
source: Google Sign In Integration
ar: تكامل تسجيل الدخول باستخدام حساب Google
de: Google-Anmeldung Integration
es: Integración de inicio de sesión de Google
id: Integrasi Masuk Google

# kAppleSignIn
source: Login with Apple Sign In
ar: تسجيل الدخول باستخدام Apple Sign In
de: Anmeldung mit Apple-Anmeldung
es: Iniciar sesión con Apple Sign In
id: Masuk dengan Masuk Apple

# kEmailSignIn
source: Login with Email & Password
ar: تسجيل الدخول باستخدام البريد الإلكتروني وكلمة المرور
de: Anmeldung mit E-Mail und Passwort
es: Iniciar sesión con correo electrónico y contraseña
id: Masuk dengan Email & Kata Sandi

# kEmailSignUp
source: Create Account with Email & Password
ar: إنشاء حساب باستخدام البريد الإلكتروني وكلمة المرور
de: Konto erstellen mit E-Mail und Passwort
es: Crear cuenta con correo electrónico y contraseña
id: Buat Akun dengan Email & Kata Sandi

# kPermissionsIntegration
source: PermissionsIntegration
ar: تكامل الأذونات
de: Berechtigungsintegration
es: Integración de permisos
id: Integrasi Izin

# kFormValidation
source: Form Validation
ar: تحقق من النماذج
de: Formularvalidierung
es: Validación de formularios
id: Validasi Formulir

# kAnalyticsBackend
source: Analytics & Backend
ar: تحليلات وخلفية
de: Analyse & Backend
es: Análisis y backend
id: Analitik & Backend

# kFirebaseAnalyticsIntegration
source: Firebase Analytics Integration
ar: تكامل تحليلات Firebase
de: Integration von Firebase Analytics
es: Integración de Firebase Analytics
id: Integrasi Analitik Firebase

# kFirestoreIntegration
source: Firestore Integration
ar: تكامل Firestore
es: Integración de Firestore
id: Integrasi Firestore

# kCrashReporting
source: Crash Reporting (Crashlytics)
ar: تقارير الأعطال (Crashlytics)
de: Crash-Berichterstattung (Crashlytics)
es: Informes de fallos (Crashlytics)
id: Pelaporan Crash (Crashlytics)

# kCrashReportingDesc
source: Includes Crash Reporting (Crashlytics), allowing developers to identify and troubleshoot crashes quickly and efficiently.
ar: تتضمن تقارير الأعطال (Crashlytics) ، مما يتيح للمطورين التعرف على الأعطال وإصلاحها بسرعة وكفاءة.
de: Enthält die Crash-Berichterstattung (Crashlytics), die Entwicklern ermöglicht, Abstürze schnell und effizient zu identifizieren und zu beheben.
es: Incluye informes de fallos (Crashlytics), permitiendo a los desarrolladores identificar y solucionar problemas rápidamente y de manera eficiente.
id: Termasuk Pelaporan Crash (Crashlytics), memungkinkan pengembang untuk mengidentifikasi dan menyelesaikan masalah crash dengan cepat dan efisien.

# kLogging
source: Logging
ar: تسجيل الدخول
de: Protokollierung

# kLoggingDesc
source: Included features Logging, providing developers with valuable insights into app performance and user behavior.
ar: يشمل ميزات التسجيل ، والتي توفر للمطورين إدراكًا قيمًا حول أداء التطبيق وسلوك المستخدم.
de: Enthält Funktionen zur Protokollierung, die Entwicklern wertvolle Einblicke in die Leistung und das Verhalten der Benutzer der App bieten.
es: Incluye funciones de registro (Logging), proporcionando a los desarrolladores información valiosa sobre el rendimiento de la aplicación y el comportamiento del usuario.
id: Fitur Logging tercakup, memberikan wawasan berharga bagi pengembang tentang performa aplikasi dan perilaku pengguna.

# kBoilerplateName
source: Boilerplate
es: Repetitivo

# kBuildFlavors
source: Build Flavors
es: Sabores de compilación

# kFlutter_displaymode
source: Displaymode
de: Anzeigemodus

# kEasy_localization
source: Easy localization
de: Einfache Lokalisierung

# kNullSafety
source: Null Safety
de: Nullsicherheit
